In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import matplotlib.pyplot as plt
%matplotlib inline

In [7]:
# Excel查找替换
df = DataFrame(data={
    'name':['liwei','liangl','ting','mery','jack'],
    'c_name':['还好','催化','苹果','梨子','科技'],
    'age':np.random.randint(1,100,size=5),
    'salary':np.random.random(size=5)*10000
})
df

     name c_name  age       salary
0   liwei     还好   99  5570.091355
1  liangl     催化    5  2657.307063
2    ting     苹果    9  5699.014142
3    mery     梨子   67  9120.793445
4    jack     科技   87  8473.322481

In [9]:
df.loc[1,'salary']= None
df

     name c_name  age       salary
0   liwei     还好   99  5570.091355
1  liangl     催化    5          NaN
2    ting     苹果    9  5699.014142
3    mery     梨子   67  9120.793445
4    jack     科技   87  8473.322481

In [10]:
df.replace(to_replace=np.nan,value=df.salary.mean())

     name c_name  age       salary
0   liwei     还好   99  5570.091355
1  liangl     催化    5  7215.805356
2    ting     苹果    9  5699.014142
3    mery     梨子   67  9120.793445
4    jack     科技   87  8473.322481

In [19]:
score = DataFrame(data=np.random.randint(0,100,size=(5,3)),columns=['python','java','c'])
score

   python  java   c
0      19    70  58
1      78    76  82
2      78    94  28
3      80    29  74
4      89    57   2

In [20]:
score.iloc[(0,1),(2,2)] =100
score

   python  java    c
0      19    70  100
1      78    76  100
2      78    94   28
3      80    29   74
4      89    57    2

In [21]:
# to_replace:要替换的值
# 将100替换为当列的平均值
score.replace(to_replace=100,value=score.mean())

   python  java     c
0      19    70  60.8
1      78    76  60.8
2      78    94  28.0
3      80    29  74.0
4      89    57   2.0

In [22]:
df

     name c_name  age       salary
0   liwei     还好   99  5570.091355
1  liangl     催化    5          NaN
2    ting     苹果    9  5699.014142
3    mery     梨子   67  9120.793445
4    jack     科技   87  8473.322481

In [23]:
# None无效
df.replace(to_replace=np.nan,value="替换")

     name c_name  age       salary
0   liwei     还好   99  5570.091355
1  liangl     催化    5           替换
2    ting     苹果    9  5699.014142
3    mery     梨子   67  9120.793445
4    jack     科技   87  8473.322481

In [25]:
# 使用列表值进行多值替换,注意个数匹配，也可一在to_replace里面直接传入字典,字典也可以进行某一列替换
df.replace(to_replace=['还好','催化'],value=['嗨浩','翠花'],inplace=False)

     name c_name  age       salary
0   liwei     嗨浩   99  5570.091355
1  liangl     翠花    5          NaN
2    ting     苹果    9  5699.014142
3    mery     梨子   67  9120.793445
4    jack     科技   87  8473.322481

In [31]:
df.replace(to_replace={'c_name':'嗨浩'},value='冯亮')

     name c_name  age       salary
0   liwei     还好   99  5570.091355
1  liangl     催化    5          NaN
2    ting     苹果    9  5699.014142
3    mery     梨子   67  9120.793445
4    jack     科技   87  8473.322481

In [33]:
# 使用正则替换
df.replace(to_replace=['还好','催化'],value=['lulu','lucy'],inplace=True)
df

     name c_name  age       salary
0   liwei   lulu   99  5570.091355
1  liangl   lucy    5          NaN
2    ting     苹果    9  5699.014142
3    mery     梨子   67  9120.793445
4    jack     科技   87  8473.322481

In [34]:
# 使用正则替换
df.replace(to_replace='lu.*',value='正则替换',regex=True)

     name c_name  age       salary
0   liwei   正则替换   99  5570.091355
1  liangl   正则替换    5          NaN
2    ting     苹果    9  5699.014142
3    mery     梨子   67  9120.793445
4    jack     科技   87  8473.322481

In [38]:
# Series参数说明：
# method：对指定的值使用相邻的值填充
# limit：设定填充次数
c_name = df.c_name.copy()
c_name

0    lulu
1    lucy
2      苹果
3      梨子
4      科技
Name: c_name, dtype: object

In [39]:
c_name.replace(to_replace='lulu',value="露露",limit=1)

/var/folders/cq/85708z8s7czfx4wkp637mqg00000gn/T/ipykernel_45836/3405619374.py:1: FutureWarning: The 'limit' keyword in Series.replace is deprecated and will be removed in a future version.
  c_name.replace(to_replace='lulu',value="露露",limit=1)

0      露露
1    lucy
2      苹果
3      梨子
4      科技
Name: c_name, dtype: object

In [41]:
# 使用相邻值替换，仅限在series中使用，无法在DataFrame使用
c_name.replace(method ='bfill',to_replace='lucy',value="露露",limit=1)

/var/folders/cq/85708z8s7czfx4wkp637mqg00000gn/T/ipykernel_45836/3479389309.py:2: FutureWarning: The 'method' keyword in Series.replace is deprecated and will be removed in a future version.
  c_name.replace(method ='bfill',to_replace='lucy',value="露露",limit=1)

0    lulu
1      苹果
2      苹果
3      梨子
4      科技
Name: c_name, dtype: object